const typesTranslate = {
    'Normal': "Нормальный",
    'Fire': "Огненный",
    'Water': "Водяной",
    'Grass': "Травяной",
    'Fighting': "Боевой",
    'Poison': "Ядовитый",
    'Electric': "Электрический",
    'Ground': "Земляной",
    'Rock': "Каменный",
    'Psychic': "Психический",
    'Ice': "Ледяной",
    'Ghost': "Призрачный",
    'Steel': "Стальной",
    'Dragon': "Драконий",
    'Dark': "Темный",
    'Fairy': "Волшебный"
}

const beaverNames = ['Аарон','Аба','Август','Авель','Авигдор','Аврелий','Аги','Адольф','Адриан','Аквилий','Аксель','Алек','Алон'
    ,'Альберт','Альбин','Альваро','Альвиан','Альвизе','Альфонс','Альфред','Амадис','Амин','Амир','Андрей','Антон','Антуан'
    ,'Арам','Аристарх','Аристон','Арсений','Атом','Ахилл','Ахмад','Ашот','Барни','Бартоломео','Баян','Бен','Бенедикт','Беньямин'
    ,'Бонавентура','Бямбасурэн','Вадим','Валентино','Валерьян','Вальдемар','Венансио','Вигго','Викентий','Виктор','Владик'
    ,'Вольфганг','Вук','Гамлет','Гаспар','Генри','Генрих','Гераклид','Герхард','Гийом','Гильем','Гинкмар','Горацио','Густав'
    ,'Даниил','Джафар','Джон','Джулиус','Донателло','Дмитрий','Доминик','Дональд','Евгений','Егор','Елеазар','Елисей','Емельян'
    ,'Жан','Жоан','Зигмунд','Иан','Ибрахим','Иван','Игнатий','Игорь','Израиль','Илья','Иннокентий','Исаак','Исмаил','Калин'
    ,'Кайрон','Карлос','Картерий','Кассиан','Кассий','Касторий','Касьян','Катберт','Квинт','Киллиан','Ким','Кирчик','Кирилл'
    ,'Клеоник','Конон','Константин','Корнелиус','Крис','Криспин','Кронид','Кэлин','Лаврентий','Лазарь','Лайл','Лев','Леви'
    ,'Леонардо','Лиам','Линкей','Лоренцо','Луи','Лукас','Луций','Людовик','Люцифер','Максим','Малик','Мануэль','Мариан','Марк'
    ,'Матвей','Матфей','Махмуд','Меир','Мелентий','Мелитон','Мика','Мила','Микеланджело','Мирон','Мирослав','Михаил','Михей'
    ,'Натаниэль','Никита','Николай','Ноа','Октав','Октавиан','Октавий','Октавио','Олег','Оливер','Оскар','Осман','Отто','Оттон'
    ,'Пабло','Павел','Павлин','Палладий','Пантелеймон','Паруйр','Парфений','Патрик','Педро','Пётр','Поликарп','Поликрат'
    ,'Протасий','Рагнар','Раймонд','Рахман','Рафаель','Рейнхард','Ренат','Реститут','Ричард','Роберт','Родерик','Родион','Рожер'
    ,'Розарио','Роман','Ромен','Рон','Ронан','Рудольф','Руслан','Руф','Савва','Саддам','Салих','Самуил','Святослав','Севастьян'
    ,'Северин','Семён','Серапион','Сергей','Серж','Сильвестр','Симеон','Симон','Соломон','Станислав','Степан','Стефано','Стивен'
    ,'Таврион','Тавус','Тадеуш','Тарас','Тейс','Тендзин','Теофил','Терентий','Терри','Тимофей','Тимур','Тихомир','Тихон','Томас'
    ,'Томоми','Торос','Тофик','Трифон','Тутмос','Тьерри','Тьяго','Уве','Уильям','Улдис','Ульрих','Ульф','Умар','Усама','Фарид'
    ,'Фахраддин','Федериго','Федот','Феликс','Феоктист','Феофан','Феофил','Феофилакт','Фердинанд','Ференц','Фёдор','Фидель'
    ,'Филарет','Филат','Филип','Филипп','Философ','Фома','Франц','Франческо','Фредерик','Фридрих','Фродо','Фрол','Хайме','Ханс'
    ,'Харальд','Харитон','Харри','Харрисон','Хасан','Хильдерик','Хирам','Хлодвиг','Хокон','Хорив','Хоселито','Хосрой','Хрисанф'
    ,'Христофор','Хуан','Чеслав','Шалом','Шамиль','Шамсуддин','Шапур','Шарль','Шон','Эберхард','Эдмунд','Эдуард','Элиас'
    ,'Эллиот','Эмиль','Энрик','Энрико','Энтони','Эрик','Эрнест','Эстебан','Этьен','Юлиан','Юлий','Юстин','Яков','Ян','Яни'
    ,'Януарий','ъуъ','Яромир','Ярополк','Ярослав']

module.exports = { typesTranslate, beaverNames }